# -*- coding: utf-8 -*-

# 导入包
import matplotlib.pyplot as plt
import numpy as np

# 显示中文和显示负号
plt.rcParams['font.sans-serif'] = ['SimHei']
plt.rcParams['axes.unicode_minus'] = False


# 豆瓣TOP250电影时长分布，统计电影时长分布直方图
# 横坐标是电影时长，纵坐标统计出每个时长段的电影数量
a=[131,  98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107, 114, 119, 128, 121, 142, 127, 130, 124, 101, 110, 116, 117, 110, 128, 128, 115,  99, 136, 126, 134,  95, 138, 117, 111,78, 132, 124, 113, 150, 110, 117,  86,  95, 144, 105, 126, 130,126, 130, 126, 116, 123, 106, 112, 138, 123,  86, 101,  99, 136,123, 117, 119, 105, 137, 123, 128, 125, 104, 109, 134, 125, 127,105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120, 114,105, 115, 132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134,156, 106, 117, 127, 144, 139, 139, 119, 140,  83, 110, 102,123,107, 143, 115, 136, 118, 139, 123, 112, 118, 125, 109, 119, 133,112, 114, 122, 109, 106, 123, 116, 131, 127, 115, 118, 112, 135,115, 146, 137, 116, 103, 144,  83, 123, 111, 110, 111, 100, 154,136, 100, 118, 119, 133, 134, 106, 129, 126, 110, 111, 109, 141,120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114, 125, 126,114, 140, 103, 130, 141, 117, 106, 114, 121, 114, 133, 137,  92,121, 112, 146,  97, 137, 105,  98, 117, 112,  81,  97, 139, 113,134, 106, 144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110,105, 129, 137, 112, 120, 113, 133, 112,  83,  94, 146, 133, 101,131, 116, 111,  84, 137, 115, 122, 106, 144, 109, 123, 116, 111,111, 133, 150]

# 根据电影时长，找出最短和最长的，然后选取合适的组距进行分组
# 组距, 最大最小出于组距取整，查看最大值最小值能被整除的数
# 刚刚整除，最后刻度分组刻度和直方图宽度才是一直均匀分布的，可以通过网格线查看
d = 6
num_bins = (max(a) - min(a)) // d
print(max(a))
print(min(a))
print(num_bins)

# 创建figure窗口，指定窗口大小和分辨率
plt.figure(dpi=128, figsize=(8, 6))

# 画直方图, 自动根据分组统计每个时段的电影数量
# x轴是一个连续变量，y轴是组距,hist会根据组距和a列表，
# 自动统计每个组距里面的出现次数，自动进行分组
plt.hist(a, num_bins, color='orange', label='电影数量分布')

# 设置图表名称和坐标轴名称
plt.title('豆瓣电影Top250电影时长分布图', fontsize=24)
plt.xlabel('电影时长(分钟)', fontsize=14)
plt.ylabel('电影数量', fontsize=14)

# 显示网格线，显示图例，注意该处显示中文的参数是prop，alpha透明度
plt.grid(axis='both', color='grey', linestyle='-.', alpha=0.5)
plt.legend(loc='upper right')

# 设置坐标轴刻度，刻度间隔
plt.xticks(np.arange(78, 161, 6))
# 绘制数量图
plt.yticks(np.arange(0, 55, 5))

# 显示图形
plt.show()